# Brewfile — Refineo laptop config (generated from audit 2026-07-06)
# Install everything:  brew bundle --file="$(dirname "$0")/Brewfile"

# ── CLI formulae ──────────────────────────────────────────────
brew "awscli"
brew "bcrypt"
brew "direnv"
# brew "docker"          # DROPPED — OrbStack provides the docker CLI + engine (decision 2026-07)
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "jq"
brew "libpq"
brew "mas"               # NEW — Mac App Store CLI (was missing on old machine)
brew "node"
brew "nvm"
brew "pnpm"
brew "poppler"
brew "postgresql@18"
brew "python@3.12"
brew "render"
brew "ripgrep"
brew "speedtest-cli"
brew "supabase"
brew "tree"
brew "uv"
brew "yt-dlp"

# ── Casks (were brew-managed on old machine) ─────────────────
cask "1password"
cask "1password-cli"
cask "anylist"
cask "copyclip"
cask "elgato-camera-hub"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "iina"
cask "iterm2"
cask "keyboard-maestro"
cask "notion"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
# cask "docker-desktop"  # DECISION: skip — OrbStack was the active docker context. Uncomment if you want both.

# ── Casks (hand-installed on old machine, now brew-managed) ──
cask "claude"
cask "google-chrome"
cask "linear-linear"
cask "telegram"
cask "whatsapp"
cask "scrivener"
cask "cleanmymac"
cask "commander-one"
# Plottr — no cask; download from getplottr.com (manual install)

# ── Mac App Store (requires: signed into App Store, mas installed) ──
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Apple Remote Desktop", id: 409907375
# TurboTax 2025 + Under My Roof — install manually from App Store (search by name; ids vary)
