1password.op-vscode
42crunch.vscode-openapi
aaron-bond.better-comments
akamud.vscode-theme-onedark
antfu.iconify
anthropic.claude-code
atommaterial.a-file-icon-vscode
ban.spellright
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
chakrounanas.turbo-console-log
chrisdias.vscode-opennewinstance
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
dotjoshjohnson.xml
eamodio.gitlens
editorconfig.editorconfig
edonet.vscode-command-runner
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
financialforce.lana
formulahendry.auto-close-tag
george-alisson.html-preview-vscode
github.remotehub
github.vscode-pull-request-github
google.geminicodeassist
googlecloudtools.cloudcode
googlecloudtools.datacloud
graphql.vscode-graphql-syntax
humao.rest-client
iulian-radu-at.find-unused-exports
jordang.vs-one-dark-theme
khaeransori.json2csv
labnol.google-apps-script
matt-meyers.vscode-dbml
mechatroner.rainbow-csv
meezilla.json
mgmcdermott.vscode-language-babel
mikestead.dotenv
mohammadbaqer.better-folding
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.makefile-tools
ms-vscode.remote-repositories
mtxr.sqltools
mtxr.sqltools-driver-pg
natizyskunk.sftp
natqe.reload
naumovs.color-highlight
nhoizey.gremlins
oouo-diogo-perdigao.docthis
pkosta2005.heroku-command
pustelto.bracketeer
randomfractalsinc.vscode-data-preview
rangav.vscode-thunder-client
redhat.vscode-xml
redhat.vscode-yaml
rohangore.schema-explorer
salesforce.agent-script-language-client
salesforce.agentforce-vibes-autocomplete
salesforce.analyticsdx-vscode
salesforce.analyticsdx-vscode-core
salesforce.analyticsdx-vscode-templates
salesforce.apex-language-server-extension
salesforce.salesforce-vscode-slds
salesforce.salesforcedx-einstein-gpt
salesforce.salesforcedx-metadata-visualizer-vscode
salesforce.salesforcedx-vscode
salesforce.salesforcedx-vscode-agents
salesforce.salesforcedx-vscode-apex
salesforce.salesforcedx-vscode-apex-debugger
salesforce.salesforcedx-vscode-apex-log
salesforce.salesforcedx-vscode-apex-oas
salesforce.salesforcedx-vscode-apex-replay-debugger
salesforce.salesforcedx-vscode-apex-testing
salesforce.salesforcedx-vscode-core
salesforce.salesforcedx-vscode-expanded
salesforce.salesforcedx-vscode-lightning
salesforce.salesforcedx-vscode-lwc
salesforce.salesforcedx-vscode-metadata
salesforce.salesforcedx-vscode-org
salesforce.salesforcedx-vscode-org-browser
salesforce.salesforcedx-vscode-services
salesforce.salesforcedx-vscode-soql
salesforce.salesforcedx-vscode-ui-preview
salesforce.salesforcedx-vscode-visualforce
salesforce.sfdx-code-analyzer-vscode
seyyedkhandon.firacode
shd101wyy.markdown-preview-enhanced
steoates.autoimport
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
usernamehw.errorlens
xabikos.javascriptsnippets
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
zainchen.json
