# Official Amazon AWS command-line interface
brew "awscli"
# Cross platform file encryption utility using blowfish
brew "bcrypt"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@18", link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Command-line interface for Render
brew "render"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Postgres development platform
brew "supabase"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Grocery shopping list
cask "anylist"
# Clipboard manager
cask "copyclip"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Control your Elgato key lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Automation software
cask "keyboard-maestro"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
vscode "1password.op-vscode"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "antfu.iconify"
vscode "anthropic.claude-code"
vscode "atommaterial.a-file-icon-vscode"
vscode "ban.spellright"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "edonet.vscode-command-runner"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "financialforce.lana"
vscode "formulahendry.auto-close-tag"
vscode "george-alisson.html-preview-vscode"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "googlecloudtools.datacloud"
vscode "graphql.vscode-graphql-syntax"
vscode "humao.rest-client"
vscode "iulian-radu-at.find-unused-exports"
vscode "jordang.vs-one-dark-theme"
vscode "khaeransori.json2csv"
vscode "labnol.google-apps-script"
vscode "matt-meyers.vscode-dbml"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mohammadbaqer.better-folding"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "natizyskunk.sftp"
vscode "natqe.reload"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "oouo-diogo-perdigao.docthis"
vscode "pkosta2005.heroku-command"
vscode "pustelto.bracketeer"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rohangore.schema-explorer"
vscode "salesforce.agent-script-language-client"
vscode "salesforce.agentforce-vibes-autocomplete"
vscode "salesforce.analyticsdx-vscode"
vscode "salesforce.analyticsdx-vscode-core"
vscode "salesforce.analyticsdx-vscode-templates"
vscode "salesforce.apex-language-server-extension"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-metadata-visualizer-vscode"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-agents"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-log"
vscode "salesforce.salesforcedx-vscode-apex-oas"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-apex-testing"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-expanded"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-metadata"
vscode "salesforce.salesforcedx-vscode-org"
vscode "salesforce.salesforcedx-vscode-org-browser"
vscode "salesforce.salesforcedx-vscode-services"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-ui-preview"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "seyyedkhandon.firacode"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "usernamehw.errorlens"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
npm "corepack"
